Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/secure-sockets/include/cy_secure_sockets.h
/*
 * Copyright 2022, Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 *
 * This software, including source code, documentation and related
 * materials ("Software") is owned by Cypress Semiconductor Corporation
 * or one of its affiliates ("Cypress") and is protected by and subject to
 * worldwide patent protection (United States and foreign),
 * United States copyright laws and international treaty provisions.
 * Therefore, you may use this Software only as provided in the license
 * agreement accompanying the software package from which you
 * obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software
 * source code solely for use in connection with Cypress's
 * integrated circuit products.  Any reproduction, modification, translation,
 * compilation, or representation of this Software except as specified
 * above is prohibited without the express written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product"). By
 * including Cypress's product in a High Risk Product, the manufacturer
 * of such system or application assumes all risk of such use and in doing
 * so agrees to indemnify Cypress against all liability.
 */

/** @file
 *  Defines the Secure Sockets Interface.
 *  
 *  This file provides functions to communicate over the IP network.
 *  The interface is broadly based on the POSIX sockets API function, but provides a subset and tailored to RTOS needs.
 *  The following additional support has been added on top of the standard POSIX sockets functionality:
 *  - CY_SOCKET_IPPROTO_TLS protocol type added for the socket_create API function to support secure connections with TLS.
 *  - Options added to \ref cy_socket_setsockopt API function to:
 *    1. Configure TLS-specific parameters such as RootCA, certificate/key pair, server name for Server Name Indication (SNI) TLS extension, and Application-Layer Protocol Negotiation (ALPN) protocol list.
 *    2. Support incoming connect request (for server only), receive, and disconnect callbacks.
 *
 */

/**
 * \defgroup group_secure_sockets Secure Sockets API
 * \brief The Secure Sockets API provides functions to communicate over the IP network. The interface is broadly based on the POSIX socket APIs, but implements a subset and is tailored to RTOS needs.
 * \addtogroup group_secure_sockets
 * \{
 * \defgroup group_secure_sockets_mscs Message Sequence Charts
 * \defgroup group_secure_sockets_macros Macros
 * \defgroup group_secure_sockets_typedefs Typedefs
 * \defgroup group_secure_sockets_enums Enumerated types
 * \defgroup group_secure_sockets_structures Structures
 * \defgroup group_secure_sockets_functions Functions
 */

/**
*
* \addtogroup group_secure_sockets_mscs
* \{
*
********************************************************************************
* \section section_secure_connect Secure Connect
********************************************************************************
*
* \image html uml_secure_connect.png

********************************************************************************
* \section section_server_async Server Connect Async
********************************************************************************
*
* \image html uml_secure_server_async_connect.png
*
********************************************************************************
* \section section_rw_read Write and Read Async
********************************************************************************
*
* \image html uml_secure_write_and_read_async.png
*
* \}
*
*/

#ifndef INCLUDED_CY_SECURE_SOCKETS_INTERFACE_H_
#define INCLUDED_CY_SECURE_SOCKETS_INTERFACE_H_

#ifdef __cplusplus
extern "C" {
#endif

#include "cy_result.h"
#include "cy_secure_sockets_error.h"
#include "cy_secure_sockets_constants.h"

/******************************************************
 *                      Constants
 ******************************************************/

/**
 * \addtogroup group_secure_sockets_enums
 * \{
 */
/******************************************************
 *                      Enums
 ******************************************************/
/**
 * IP Version
 */
typedef enum
{
    CY_SOCKET_IP_VER_V4 = 4, /**< IPv4 protocol */
    CY_SOCKET_IP_VER_V6 = 6  /**< IPv6 protocol */
} cy_socket_ip_version_t;

/**
 * Options for socket option \ref CY_SOCKET_SO_TLS_AUTH_MODE
 */
typedef enum
{
    CY_SOCKET_TLS_VERIFY_NONE = 0,     /**< Peer certificate is not checked (default authentication mode for server sockets). */
    CY_SOCKET_TLS_VERIFY_OPTIONAL = 1, /**< Peer certificate is checked, but the handshake continues even if verification fails. */
    CY_SOCKET_TLS_VERIFY_REQUIRED = 2  /**< Peer must present a valid certificate; handshake is aborted if verification failed (default authentication mode for client sockets). */
} cy_socket_tls_auth_mode_t;

/**
 * Options for socket option \ref CY_SOCKET_SO_BINDTODEVICE
 */
typedef enum
{
    CY_SOCKET_STA_INTERFACE  = 0,   /**< STA or Client Interface    */
    CY_SOCKET_AP_INTERFACE   = 1,   /**< softAP Interface           */
    CY_SOCKET_ETH0_INTERFACE = 2,   /**< Ethernet Interface index 0 */
    CY_SOCKET_ETH1_INTERFACE = 3    /**< Ethernet Interface index 1 */
} cy_socket_interface_t;

/** \} group_secure_sockets_enums */

/**
 * \addtogroup group_secure_sockets_typedefs
 * \{
 */
/******************************************************
 *                      Typedefs
 ******************************************************/
/**
 * Socket handle.
 * \note The socket handle is created and returned to the caller of the \ref cy_socket_create function.
 */
typedef void * cy_socket_t;

/**
 * Socket callback functions type used to set connect, receive, and disconnect callbacks
 * using the \ref cy_socket_setsockopt function.
 */
typedef cy_rslt_t (*cy_socket_callback_t)(cy_socket_t socket_handle, void *arg);

