Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/secure-sockets/include/cy_secure_sockets.h
/** \} group_secure_sockets_typedefs */

/**
 * \addtogroup group_secure_sockets_structures
 * \{
 */

/**
 * IP Address Structure
 */
typedef struct cy_socket_ip_address
{
    cy_socket_ip_version_t version; /**< IP version \ref cy_socket_ip_version_t */

    union
    {
        uint32_t v4;    /**< IPv4 address in network byte order. */
        uint32_t v6[4]; /**< IPv6 address in network byte order. */
    } ip; /**< IP address bytes. */
} cy_socket_ip_address_t;

/**
 * Socket Address
 */
typedef struct cy_socket_sockaddr
{
    uint16_t                  port;       /**< Port Number in host byte order. */
    cy_socket_ip_address_t    ip_address; /**< IP Address. */
} cy_socket_sockaddr_t;

/**
 * Option value type for \ref CY_SOCKET_SO_CONNECT_REQUEST_CALLBACK, \ref CY_SOCKET_SO_RECEIVE_CALLBACK,
 * and \ref CY_SOCKET_SO_DISCONNECT_CALLBACK socket options.
 */
typedef struct cy_socket_opt_callback
{
    cy_socket_callback_t callback; /**< Pointer to a caller-defined callback function. */
    void * arg;                    /**< Caller-defined context to be used with the callback function. */
} cy_socket_opt_callback_t;

/**
 * Option value type for \ref CY_SOCKET_SO_JOIN_MULTICAST_GROUP, and \ref CY_SOCKET_SO_LEAVE_MULTICAST_GROUP socket options.
 */
typedef struct cy_socket_ip_mreq {
    cy_socket_ip_address_t multi_addr; /**< IP multicast address of the group. */
    cy_socket_ip_address_t if_addr;    /**< Local IP address of the interface. */
} cy_socket_ip_mreq_t;

/** \} group_secure_sockets_structures */

/**
 * \addtogroup group_secure_sockets_functions
 * \{
 * All API functions except \ref cy_socket_init and \ref cy_socket_deinit are thread-safe.
 *
 * All API functions are blocking API functions.
 *
 * Secure Sockets Library creates a worker thread for processing events from the network stack.
 * The priority of the thread is CY_RTOS_PRIORITY_ABOVENORMAL. The macro CY_RTOS_PRIORITY_ABOVENORMAL
 * is defined in abstraction-rtos/include/COMPONENT_FREERTOS/cyabs_rtos_impl.h.
 */
/******************************************************
 *                      Function Prototypes
 ******************************************************/

/**
 * Does general allocation and initialization of resources needed for the library.
 * This API function must be called before using any other socket API.
 *
 * \note \ref cy_socket_init and \ref cy_socket_deinit API functions are not thread-safe. The caller
 *       must ensure that these two API functions are not invoked simultaneously from different threads.
 * @return     CY_RSLT_SUCCESS on success; an error code on failure.
 */
cy_rslt_t cy_socket_init( void );

/**
 * Releases the resources allocated in \ref cy_socket_init function. Prior to calling this API function,
 * all created sockets must be disconnected and deleted.
 *
 * \note \ref cy_socket_init and \ref cy_socket_deinit API functions are not thread-safe. The caller
 *       must ensure that these two API functions are not invoked simultaneously from different threads.
 *
 * @return     CY_RSLT_SUCCESS on success; an error code on failure.
 *             Important error code related to this API function is: \ref CY_RSLT_MODULE_SECURE_SOCKETS_NOT_INITIALIZED
 */
cy_rslt_t cy_socket_deinit( void );

/**
 * Creates a new socket.
 *
 * \note
 * 1. \ref cy_socket_create() function creates a dual-stack socket if domain passed is \ref CY_SOCKET_DOMAIN_AF_INET6.
 * 2. Secure Sockets Library configures default send and receive timeout values to 10 seconds for a newly created socket.
 *    These default values can be overridden using the \ref cy_socket_setsockopt API. Adjust the default timeout values based on the network speed or use case.
 *    For example, to change the send timeout, use the \ref CY_SOCKET_SO_SNDTIMEO socket option; similarly, for receive timeout, use the \ref CY_SOCKET_SO_RCVTIMEO socket option.
 *
 * 3. Secure Socket Library sets default TLS authentication mode for TLS client sockets to \ref CY_SOCKET_TLS_VERIFY_REQUIRED. For TLS server sockets,
 *    it sets the default TLS authentication mode to CY_SOCKET_TLS_VERIFY_NONE. To override the default authentication mode,
 *    use \ref cy_socket_setsockopt with the \ref CY_SOCKET_SO_TLS_AUTH_MODE socket option.
 * 4. To use a socket for multicast operations over SoftAP interface, user must bind the socket to the SoftAP interface using \ref CY_SOCKET_SO_BINDTODEVICE socket option after creating the socket.
 *
 * Valid type/protocol combinations are:
 *   - \ref CY_SOCKET_TYPE_STREAM with \ref CY_SOCKET_IPPROTO_TCP or \ref CY_SOCKET_IPPROTO_TLS
 *   - \ref CY_SOCKET_TYPE_DGRAM  with \ref CY_SOCKET_IPPROTO_UDP
 *
 * @param[in]  domain   Protocol family to be used by the socket.
 *                      Refer \ref CY_SOCKET_DOMAIN_AF_INET and \ref CY_SOCKET_DOMAIN_AF_INET6.
 * @param[in]  type     Protocol type to be used by the socket.
 *                      Refer \ref CY_SOCKET_TYPE_DGRAM and \ref CY_SOCKET_TYPE_STREAM.
 * @param[in]  protocol Transport protocol to be used by the socket.
 *                      Refer \ref CY_SOCKET_IPPROTO_TCP, \ref CY_SOCKET_IPPROTO_UDP, and \ref CY_SOCKET_IPPROTO_TLS.
 * @param[out] handle   Socket handle; contents of this handle are specific to the socket layer implementation.
 * @return     CY_RSLT_SUCCESS on success; an error code on failure. On success, it also returns the socket handle.
 *             Important error codes related to this API function are: \n
 *             \ref CY_RSLT_MODULE_SECURE_SOCKETS_BADARG \n
 *             \ref CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM \n
 *             \ref CY_RSLT_MODULE_SECURE_SOCKETS_NETIF_DOES_NOT_EXIST
 */
cy_rslt_t cy_socket_create(int domain, int type, int protocol, cy_socket_t *handle);

/**
 * Connects a TCP/TLS socket to the specified server IP address and port. This API function is a blocking call.
 *
 * For secure (TLS) sockets, before calling this API function, the following TLS configuration can be set:
 * 1. RootCA using the \ref cy_tls_load_global_root_ca_certificates or \ref cy_socket_setsockopt API function with \ref CY_SOCKET_SO_TRUSTED_ROOTCA_CERTIFICATE.
 * 2. Certificate/key pair with \ref cy_tls_create_identity and \ref cy_socket_setsockopt with \ref CY_SOCKET_SO_TLS_IDENTITY.
 * 3. For TLS client sockets, the default authentication mode set is \ref CY_SOCKET_TLS_VERIFY_REQUIRED. To override the default authentication mode,
 *    use \ref cy_socket_setsockopt with the \ref CY_SOCKET_SO_TLS_AUTH_MODE socket option.
 * 4. The default mbed TLS configuration provided by the *Wi-Fi Middleware Core Library* disables the validity period verification of the certificates.
 *    To perform this verification, enable MBEDTLS_HAVE_TIME_DATE in the [mbedtls_user_config.h] (https://github.com/cypresssemiconductorco/wifi-mw-core/blob/master/configs/mbedtls_user_config.h) file. Ensure that the system time is set prior to the \ref cy_socket_connect() function call.
 *    To set the system time, get the time from the NTP server and set the system's RTC time using cyhal_rtc_init(), cyhal_rtc_write() and cy_set_rtc_instance() functions. See the [Time Support Details](https://github.com/cypresssemiconductorco/clib-support/blob/master/README.md#time-support-details)
 *    for reference. See the \ref snip12 to get the time from NTP server.
 *
 * \note This is applicable if Secure Sockets Library is built for lwIP network stack. If this function returns \ref CY_RSLT_MODULE_SECURE_SOCKETS_CLOSED error, the socket handle cannot be reused to establish the connection. The caller should invoke \ref cy_socket_delete API function to delete the current socket handle,
 * and create a new socket handle using \ref cy_socket_create API function to re-establish the connection. This is required, due to the limitation of lwIP stack.
 *
 * @param[in] handle         Socket handle returned by the \ref cy_socket_create API function.
 * @param[in] address        Pointer to the \ref cy_socket_sockaddr_t structure that contains the address to connect the socket to. Refer \ref cy_socket_ip_address_t for IP address endienness.
 * @param[in] address_length Length of the \ref cy_socket_sockaddr_t structure.
 *
 * @return    CY_RSLT_SUCCESS on success; an error code on failure.
 *            Important error codes related to this API function are: \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_BADARG \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_TLS_ERROR \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_TCPIP_ERROR \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_TIMEOUT \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM
 */
cy_rslt_t cy_socket_connect(cy_socket_t handle, cy_socket_sockaddr_t *address, uint32_t address_length);

/**
 * Disconnects a TCP/TLS socket's remote connection.
 * Timeout is not supported by all network stacks. If the underlying network stack does not support
 * the timeout option, this function returns after a clean disconnect. lwIP does not support the timeout option.
 *
 * \note Ensure that this API function is also called when the socket send/receive API fails with the error \ref CY_RSLT_MODULE_SECURE_SOCKETS_CLOSED.
 *
 * @param[in] handle         Socket handle returned by either the \ref cy_socket_create API function for client sockets,
 *                           or by the \ref cy_socket_accept API function for accepted sockets.
 *
 * @param[in] timeout        Maximum amount of time to wait in milliseconds for a clean disconnect.
 *                           When the timeout is zero, the function returns after a clean disconnect or when the operation results in an error.
 *
 * @return    CY_RSLT_SUCCESS on success; an error code on failure.
 *            Important error codes related to this API function are: \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_NOT_CONNECTED
 */
cy_rslt_t cy_socket_disconnect(cy_socket_t handle, uint32_t timeout);

/**
 * Binds the socket to the given socket address.
 *
 * @param[in] handle         Socket handle returned by the \ref cy_socket_create API function.
 * @param[in] address        Address to be bound to the socket. Refer \ref cy_socket_ip_address_t for IP address endienness.
 * @param[in] address_length Length of the \ref cy_socket_sockaddr_t structure.
 *
 * @return    CY_RSLT_SUCCESS on success; an error code on failure.
 *            Important error codes related to this API function are: \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_BADARG \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_TCPIP_ERROR \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_PROTOCOL_NOT_SUPPORTED
 */
cy_rslt_t cy_socket_bind(cy_socket_t handle, cy_socket_sockaddr_t *address, uint32_t address_length);

/**
 * Listens for TCP/TLS socket connections and limits the queue of incoming connections.
 *
 * If the socket has been configured with a connection request callback, the registered callback will be invoked
 * when the new client connection request is received. Invoke the \ref cy_socket_accept API function from the callback function
 * to accept the client connection.
 *
 * @param[in] handle        Socket handle returned by the \ref cy_socket_create API function.
 * @param[in] backlog       Maximum pending connections allowed.
 *
 * @return    CY_RSLT_SUCCESS on success; an error code on failure.
 *            Important error codes related to this API function are: \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_BADARG \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_TCPIP_ERROR
 */
cy_rslt_t cy_socket_listen(cy_socket_t handle, int backlog);

/**
 * Accepts a new TCP/TLS connection on a socket.
 *
 * This is a blocking API function that returns when there is an incoming connection request from a client.
 *
 * However, when the \ref CY_SOCKET_SO_RCVTIMEO socket option is set on the listening socket (input socket handle param),
 * this API function returns with a \ref CY_RSLT_MODULE_SECURE_SOCKETS_TIMEOUT error if there is no
 * connection request from a client within the timeout period.
 *
 * \ref CY_SOCKET_SO_RCVTIMEO can be set using the \ref cy_socket_setsockopt API function.
 *
 *
 * @param[in]  handle          Socket handle that has been created with \ref cy_socket_create,
 *                             bound to a local address with \ref cy_socket_bind,
 *                             and is listening for connections after a call to \ref cy_socket_listen.
 *                             This is the server-side socket that is reused to establish
 *                             connections across clients.
 * @param[out] address         Address of the peer socket in the cy_socket_sockaddr_t structure. Refer \ref cy_socket_ip_address_t for IP address endienness.
 * @param[out] address_length  Contains the actual size of the peer socket address.
 * @param[out] socket          Socket handle for the accepted connection with a client. This is
 *                             the socket that should be used for further communication over a
 *                             new client connection.
 *
 * @return     CY_RSLT_SUCCESS on success; an error code on failure.
 *             Important error codes related to this API function are: \n
 *             \ref CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET \n
 *             \ref CY_RSLT_MODULE_SECURE_SOCKETS_TLS_ERROR \n
 *             \ref CY_RSLT_MODULE_SECURE_SOCKETS_TIMEOUT \n
 *             \ref CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM \n
 *             \ref CY_RSLT_MODULE_SECURE_SOCKETS_BADARG \n
 *             \ref CY_RSLT_MODULE_SECURE_SOCKETS_NOT_LISTENING
 */
cy_rslt_t cy_socket_accept(cy_socket_t handle, cy_socket_sockaddr_t *address, uint32_t *address_length, cy_socket_t *socket);

/**
 * Sends data over a connected TCP/TLS socket.
 *
 * \note Ensure that the \ref cy_socket_disconnect API function is called when this API function fails with the CY_RSLT_MODULE_SECURE_SOCKETS_CLOSED error.
 * lwIP doesn't allow the socket to be reused after disconnection. Therefore, the caller should call \ref cy_socket_disconnect and \ref cy_socket_delete API functions
 * to delete the closed socket. This is applicable if Secure Sockets Library is built for lwIP network stack.
 *
 * @param[in]  handle        Socket handle returned by either the \ref cy_socket_create API function for client sockets,
 *                           or by the \ref cy_socket_accept API function for accepted sockets.
 * @param[in]  buffer        Buffer containing the data to be sent.
 * @param[in]  length        Length of the data to be sent.
 * @param[in]  flags         Flags to indicate the send options:
 *                           \ref CY_SOCKET_FLAGS_NONE and \ref CY_SOCKET_FLAGS_MORE
 * @param[out] bytes_sent    Number of bytes sent.
 *
 * @return    CY_RSLT_SUCCESS on success; an error code on failure. On success, it also returns the number of bytes sent.
 *            Important error codes related to this API function are: \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_TLS_ERROR \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_TCPIP_ERROR \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_TIMEOUT \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_NOT_CONNECTED \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_CLOSED \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_WOULDBLOCK
 */
cy_rslt_t cy_socket_send(cy_socket_t handle, const void *buffer, uint32_t length, int flags, uint32_t *bytes_sent);

/**
 * Sends a UDP datagram over a specified socket.
 *
 * \note If an ARP entry for the specified destination address is not present in the ARP cache, this function sends an ARP request and waits for
 *       \ref ARP_WAIT_TIME_IN_MSEC time for MAC address resolution. If the MAC address is not resolved within the timeout, this function
 *       returns the error code \ref CY_RSLT_MODULE_SECURE_SOCKETS_ARP_TIMEOUT. Upon receiving this error, the caller can retry this API again after a brief delay.
 *
 * @param[in]  handle         Socket handle returned by the \ref cy_socket_create API function for UDP sockets.
 * @param[in]  buffer         Buffer containing the data to be sent.
 * @param[in]  length         Length of the data to be sent.
 * @param[in]  flags          Flags to indicate send options. Currently, this argument is not used; this is reserved for the future.
 * @param[in]  dest_addr      Pointer to the \ref cy_socket_sockaddr_t structure that contains the destination
 *                            address to send the data to. Refer \ref cy_socket_ip_address_t for IP address endienness.
 * @param[in]  address_length Length of the \ref cy_socket_sockaddr_t structure.
 * @param[out] bytes_sent     Number of bytes sent.
 *
 * @return    CY_RSLT_SUCCESS on success; an error code on failure. On success, it also returns the number of bytes sent.
 *            Important error code related to this API function is: \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_NETIF_DOES_NOT_EXIST \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_ARP_TIMEOUT \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_ERROR_ROUTING
 */
cy_rslt_t cy_socket_sendto(cy_socket_t handle, const void *buffer, uint32_t length, int flags, const cy_socket_sockaddr_t *dest_addr, uint32_t address_length, uint32_t *bytes_sent);

/**
 * Receives the data from a connected TCP/TLS socket.
 *
 * \note Ensure that the \ref cy_socket_disconnect API function is called when this API function fails with the CY_RSLT_MODULE_SECURE_SOCKETS_CLOSED error.
 * lwIP doesn't allow the socket to be reused after disconnection. Therefore, the caller should call \ref cy_socket_disconnect and \ref cy_socket_delete API functions
 * to delete the closed socket. This is applicable if Secure Sockets Library is built for lwIP network stack.
 *
 * @param[in]  handle         Socket handle returned by either the \ref cy_socket_create API function for client sockets,
 *                            or by \ref cy_socket_accept API function for accepted sockets.
 * @param[out] buffer         Buffer into which received data will be placed.
 * @param[in]  length         Size of the data buffer.
 * @param[in]  flags          Not currently used. Should be set to \ref CY_SOCKET_FLAGS_NONE.
 * @param[out] bytes_received Number of bytes received.
 *
 * @return     CY_RSLT_SUCCESS on success; an error code on failure. On success, it also returns number of bytes received.
 *             Important error codes related to this API function are: \n
 *             \ref CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET \n
 *             \ref CY_RSLT_MODULE_SECURE_SOCKETS_TLS_ERROR \n
 *             \ref CY_RSLT_MODULE_SECURE_SOCKETS_TCPIP_ERROR \n
 *             \ref CY_RSLT_MODULE_SECURE_SOCKETS_TIMEOUT \n
 *             \ref CY_RSLT_MODULE_SECURE_SOCKETS_CLOSED \n
 *             \ref CY_RSLT_MODULE_SECURE_SOCKETS_WOULDBLOCK
 */
cy_rslt_t cy_socket_recv(cy_socket_t handle, void *buffer, uint32_t length, int flags, uint32_t *bytes_received);

/**
 * Receives a UDP datagram for the specified socket.
 *
 * \note
 * 1. If the datagram is larger than the supplied buffer, excess bytes in the datagram is discarded.
 * 2. To receive data from a specific source address, the caller should set \ref CY_SOCKET_FLAGS_RECVFROM_SRC_FILTER flag in the 'flags' parameter, and assign
 *    the source address through the 'src_addr' parameter. If \ref CY_SOCKET_FLAGS_RECVFROM_SRC_FILTER flag is set and src_addr is NULL, this function
 *    returns with the error code \ref CY_RSLT_MODULE_SECURE_SOCKETS_BADARG.
 *
 * @param[in]      handle             Socket handle returned by either the \ref cy_socket_create API function for client sockets,
 *                                    or by \ref cy_socket_accept API function for accepted sockets.
 * @param[out]     buffer             Buffer into which the received data will be placed.
 * @param[in]      length             Size of the data buffer.
 * @param[in]      flags              Flags to control the datagram to be received.
 *                                    Refer \ref CY_SOCKET_FLAGS_RECVFROM_NONE and \ref CY_SOCKET_FLAGS_RECVFROM_SRC_FILTER.
 * @param[in, out] src_addr           Pointer to the \ref cy_socket_sockaddr_t structure to store the sender's address.
 *                                    If passed as NULL, the sender's address is not returned to the caller.
 *                                    If the \ref CY_SOCKET_FLAGS_RECVFROM_SRC_FILTER flag is set, it contains the source address from which the datagram to be received.
 *                                    Refer \ref cy_socket_ip_address_t for IP address endienness.
 * @param[in]      src_addr_length    Pointer containing source address length. Currently, this argument is not used; this is reserved for the future.
 * @param[out]     bytes_received     Number of bytes received.
 *
 * @return     CY_RSLT_SUCCESS on success; an error code on failure. On success, it returns the number of bytes received. If src_addr is not NULL it also returns sender address.
 *             Important error code related to this API function is: \n
 *             \ref CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET \n
 *             \ref CY_RSLT_MODULE_SECURE_SOCKETS_BADARG
 */
cy_rslt_t cy_socket_recvfrom(cy_socket_t handle, void *buffer, uint32_t length, int flags, cy_socket_sockaddr_t *src_addr, uint32_t *src_addr_length, uint32_t *bytes_received);

