Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/secure-sockets/include/cy_secure_sockets.h
/**
 * Sets a particular socket option.
 * This API function can be called multiple times for the same socket to set various socket options.
 *
 * @param[in] handle         Handle of the socket to set the option for.
 * @param[in] level          Level at which the option resides:\n
 *                           \ref CY_SOCKET_SOL_SOCKET \n
 *                           \ref CY_SOCKET_SOL_TCP \n
 *                           \ref CY_SOCKET_SOL_TLS
 * @param[in] optname        Socket option to be set: \n
 *                           \ref CY_SOCKET_SO_RCVTIMEO \n
 *                           \ref CY_SOCKET_SO_SNDTIMEO \n
 *                           \ref CY_SOCKET_SO_NONBLOCK \n
 *                           \ref CY_SOCKET_SO_TCP_USER_TIMEOUT \n
 *                           \ref CY_SOCKET_SO_CONNECT_REQUEST_CALLBACK \n
 *                           \ref CY_SOCKET_SO_RECEIVE_CALLBACK \n
 *                           \ref CY_SOCKET_SO_DISCONNECT_CALLBACK \n
 *                           \ref CY_SOCKET_SO_TRUSTED_ROOTCA_CERTIFICATE \n
 *                           \ref CY_SOCKET_SO_TLS_IDENTITY \n
 *                           \ref CY_SOCKET_SO_SERVER_NAME_INDICATION \n
 *                           \ref CY_SOCKET_SO_ALPN_PROTOCOLS \n
 *                           \ref CY_SOCKET_SO_TLS_AUTH_MODE \n
 *                           \ref CY_SOCKET_SO_TLS_MFL \n
 *                           \ref CY_SOCKET_SO_JOIN_MULTICAST_GROUP \n
 *                           \ref CY_SOCKET_SO_LEAVE_MULTICAST_GROUP \n
 *                           \ref CY_SOCKET_SO_IP_MULTICAST_TTL \n
 *                           \ref CY_SOCKET_SO_BROADCAST \n
 *                           \ref CY_SOCKET_SO_IP_TOS
 * @param[in] optval         A buffer containing the value of the option to set.
 * @param[in] optlen         The length of the buffer pointed to by optval.
 *
 * @return    CY_RSLT_SUCCESS on success; an error code on failure.
 *            Important error codes related to this API function are: \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_BADARG \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_ALREADY_CONNECTED \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_OPTION \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_ADDRESS_IN_USE \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_MAX_MEMBERSHIP_ERROR \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_MULTICAST_ADDRESS_NOT_REGISTERED \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_OPTION_NOT_SUPPORTED
 */
cy_rslt_t cy_socket_setsockopt(cy_socket_t handle, int level, int optname, const void *optval, uint32_t optlen);

/**
 * Gets the value of a particular socket option.
 *
 * @param[in] handle         Handle of the socket to get the option value for.
 * @param[in] level          Level at which the option resides:\n
 *                           \ref CY_SOCKET_SOL_SOCKET \n
 *                           \ref CY_SOCKET_SOL_TCP \n
 *                           \ref CY_SOCKET_SOL_TLS
 * @param[in] optname        Socket options: \n
 *                           \ref CY_SOCKET_SO_RCVTIMEO \n
 *                           \ref CY_SOCKET_SO_SNDTIMEO \n
 *                           \ref CY_SOCKET_SO_NONBLOCK \n
 *                           \ref CY_SOCKET_SO_NWRITE \n
 *                           \ref CY_SOCKET_SO_TCP_USER_TIMEOUT \n
 *                           \ref CY_SOCKET_SO_SERVER_NAME_INDICATION \n
 **                          \ref CY_SOCKET_SO_TLS_AUTH_MODE \n
 **                          \ref CY_SOCKET_SO_IP_TOS
 * @param[out] optval        Buffer containing the value of the option to get.
 * @param[in, out] optlen    Length of the option value. It is a value-result argument;
 *                           the caller provides the size of the buffer pointed to by optval,
 *                           and is modified by this function on return to indicate
 *                           the actual size of the value returned.
 *
 * @return    CY_RSLT_SUCCESS on success; an error code on failure.
 *            Important error codes related to this API function are: \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_BADARG \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_OPTION \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_PROTOCOL_NOT_SUPPORTED \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_OPTION_NOT_SUPPORTED
 */
cy_rslt_t cy_socket_getsockopt(cy_socket_t handle, int level, int optname, void *optval, uint32_t *optlen);

/**
 * Resolves a host name using Domain Name Service.
 *
 * @param[in]  hostname        Hostname to resolve. It should be a null-terminated string containing ASCII characters.
 * @param[in]  ip_ver          IP version type \ref cy_socket_ip_version_t for which the hostname has to be resolved.
 * @param[out] addr            IP address of the specified host. Refer \ref cy_socket_ip_address_t for IP address endienness.
 *
 * @return    On success it returns CY_RSLT_SUCCESS and the IP address of the specified host. Returns an error code on failure.
 *            Important error codes related to this API function are: \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_BADARG \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_HOST_NOT_FOUND
 */
cy_rslt_t cy_socket_gethostbyname(const char *hostname, cy_socket_ip_version_t ip_ver, cy_socket_ip_address_t *addr);

/**
 * Checks whether data is available on the socket.
 *
 * @param[in]      handle        Socket handle returned by either the \ref cy_socket_create API function for client sockets,
 *                               or by \ref cy_socket_accept API function for accepted sockets.
 * @param[in, out] rwflags       On input, the flags indicate whether the socket needs to be polled for read/write/read-write operation.
 *                               On return, the flags are updated to indicate the status of the socket readiness for a read/write/read-write operation.
 * @param[in]      timeout       Maximum amount of time in milliseconds to wait before returning. If timeout is zero, the function
 *                               returns immediately. If timeout is \ref CY_SOCKET_NEVER_TIMEOUT, the function waits indefinitely.
 *
 * @return    On success, it returns CY_RSLT_SUCCESS. The CY_SOCKET_POLL_READ flag is set
 *            in the rwflags parameter if data is available for read. The CY_SOCKET_POLL_WRITE flag is set
 *            if the socket is ready for write operations. Returns an error code on failure.
 *            Important error codes related to this API function are: \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_NOT_CONNECTED
  */
cy_rslt_t cy_socket_poll(cy_socket_t handle, uint32_t *rwflags, uint32_t timeout);

/**
 * Shuts down the send and/or receive operation on the given TCP socket.
 *
 * \note This API is not applicable for UDP.
 *
 * @param[in] handle        Socket handle.
 * @param[in] how           Socket shutdown modes. Supported modes: \ref CY_SOCKET_SHUT_RD,
 *                          \ref CY_SOCKET_SHUT_WR, and \ref CY_SOCKET_SHUT_RDWR.
 *
 * @return    CY_RSLT_SUCCESS on success; an error code on failure.
 *            Important error code related to this API function is: \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_BADARG
 */
cy_rslt_t cy_socket_shutdown(cy_socket_t handle, int how);

/**
 * Releases the resources allocated for the socket by the \ref cy_socket_create function.
 *
 * @param[in] handle        Socket handle returned by the \ref cy_socket_create API function.
 * @return    CY_RSLT_SUCCESS on success; an error code on failure.
 *            Important error code related to this API function is: \n
 *            \ref CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET
 */
cy_rslt_t cy_socket_delete(cy_socket_t handle);

/** \} group_secure_sockets_functions */
#ifdef __cplusplus
} /*extern "C" */
#endif
#endif /* ifndef INCLUDED_CY_SECURE_SOCKETS_INTERFACE_H_ */

/** \} group_secure_sockets */
